/**
 * টাইটেল থেকে ইউনিক এবং SEO ফ্রেন্ডলি স্ল্যাগ তৈরি করার ফাংশন
 * @param {string} text
 * @returns {string}
 */
export const convertToSlug = (text) => {
  return text
    .toString()
    .toLowerCase()
    .trim()
    .replace(/\s+/g, "-") // স্পেসগুলোকে হাইফেন (-) দিয়ে রিপ্লেস করবে
    .replace(/[^\w\u0980-\u09ff-]+/g, "") // ইংরেজি, বাংলা ক্যারেক্টার ও হাইফেন বাদে সব স্পেশাল ক্যারেক্টার রিমুভ করবে
    .replace(/--+/g, "-") // একাধিক হাইফেন থাকলে একটা করবে
    .replace(/^-+/, "") // শুরুর হাইফেন ট্রিম করবে
    .replace(/-+$/, ""); // শেষের হাইফেন ট্রিম করবে
};
